system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// adjustTimeStep  yes;

// maxCo           1;

interpolate     true;

functions
{
}

functions
{
  probes
  {
    type probes;
    functionObjectLibs
      (
        "libsampling.so"
      );
    enabled yes;
    outputControl timeStep;
    outputInterval 1;
    fields
      (
        U
      );
    probeLocations
      10	
      (
        (207200 737700 260)
        (207200 737700 270)
        (207200 737700 280)
        (207200 737700 290)
        (207200 737700 300)
        (207200 737700 310)
        (207200 737700 320)
        (207200 737700 330)
        (207200 737700 340)
        (207200 737700 350)
      );
  }
} 	// ************************************************************************* //

// ************************************************************************* //
