0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

//    wall
//    {
//        type            nutkWallFunction;
//        value           uniform 0;
//    }


    wall
    {
        type            nutkRoughWallFunction;
	z0		0.0;
	Ks		uniform 0.0;
	Cs		uniform 0.005;
        value           uniform 0.0030;
    }

ground
{
     type            nutkRoughWallFunction;
     z0              uniform 0.024;
     value           uniform 0.003;
     Ks uniform 0.0;
     Cs uniform 0.005;


//    type     nutURoughWallFunction;
//    roughnessHeight 0.024; //1e-5
//    roughnessConstant 0.5;
//    roughnessFactor  1;
//    value    0;
}

top{
	type slip;
}

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
